load-test.txt

$ hey -z 10s -c 50 -H "Referer: https://example.com/" -H "Origin: http://localhost:3000/" -m GET "http://46.101.96.119/collect?v=0.0.0&ec=interaction&b=topol-kloktat-dehet-7dd827a&d=books-are-next.github.io%2F&u=https%3A%2F%2Fbooks-are-next.github.io%2Ftopol-kloktat-dehet%2F&l=https%3A%2F%2Fbooks-are-next.github.io%2Ftopol-kloktat-dehet%2F&p=%2Ftopol-kloktat-dehet%2F&en=view_menu&em=click"

Summary:
  Total:        10.0551 secs
  Slowest:      0.3256 secs
  Fastest:      0.0452 secs
  Average:      0.0793 secs
  Requests/sec: 629.0328
  
  Total data:   12650 bytes
  Size/request: 2 bytes

Response time histogram:
  0.045 [1]     |
  0.073 [2732]  |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.101 [3145]  |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.129 [347]   |■■■■
  0.157 [49]    |■
  0.185 [2]     |
  0.213 [3]     |
  0.241 [0]     |
  0.270 [36]    |
  0.298 [1]     |
  0.326 [9]     |


Latency distribution:
  10% in 0.0621 secs
  25% in 0.0677 secs
  50% in 0.0759 secs
  75% in 0.0854 secs
  90% in 0.0965 secs
  95% in 0.1060 secs
  99% in 0.1556 secs

Details (average, fastest, slowest):
  DNS+dialup:   0.0007 secs, 0.0452 secs, 0.3256 secs
  DNS-lookup:   0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:    0.0000 secs, 0.0000 secs, 0.0016 secs
  resp wait:    0.0784 secs, 0.0451 secs, 0.2452 secs
  resp read:    0.0001 secs, 0.0000 secs, 0.0073 secs

Status code distribution:
  [200] 6325 responses